In [5]:
!pip install pandas

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: pandas in c:\programdata\anaconda3\lib\site-packages (2.1.4)
Requirement already satisfied: numpy<2,>=1.23.2 in c:\programdata\anaconda3\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\programdata\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\programdata\anaconda3\lib\site-packages (from pandas) (2023.3.post1)
Requirement already satisfied: tzdata>=2022.1 in c:\programdata\anaconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in c:\programdata\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [1]:
import numpy as np
import pandas as pd

In [18]:
df=pd.DataFrame(data=np.arange(0,20).reshape(4,5),index=["Row1","Row2","Row3","Row4"],columns=["Column1","Column2","Column3","Column4","Column5"])

      Column1  Column2  Column3  Column4  Column5
Row1        0        1        2        3        4
Row2        5        6        7        8        9
Row3       10       11       12       13       14
Row4       15       16       17       18       19

In [20]:
type(df)

pandas.core.frame.DataFrame

In [75]:
df.loc['Row1']

Column1    0
Column2    1
Column3    2
Column4    3
Column5    4
Name: Row1, dtype: int32

In [25]:
dir(pd)

['ArrowDtype',
 'BooleanDtype',
 'Categorical',
 'CategoricalDtype',
 'CategoricalIndex',
 'DataFrame',
 'DateOffset',
 'DatetimeIndex',
 'DatetimeTZDtype',
 'ExcelFile',
 'ExcelWriter',
 'Flags',
 'Float32Dtype',
 'Float64Dtype',
 'Grouper',
 'HDFStore',
 'Index',
 'IndexSlice',
 'Int16Dtype',
 'Int32Dtype',
 'Int64Dtype',
 'Int8Dtype',
 'Interval',
 'IntervalDtype',
 'IntervalIndex',
 'MultiIndex',
 'NA',
 'NaT',
 'NamedAgg',
 'Period',
 'PeriodDtype',
 'PeriodIndex',
 'RangeIndex',
 'Series',
 'SparseDtype',
 'StringDtype',
 'Timedelta',
 'TimedeltaIndex',
 'Timestamp',
 'UInt16Dtype',
 'UInt32Dtype',
 'UInt64Dtype',
 'UInt8Dtype',
 '__all__',
 '__builtins__',
 '__cached__',
 '__doc__',
 '__docformat__',
 '__file__',
 '__git_version__',
 '__loader__',
 '__name__',
 '__package__',
 '__path__',
 '__spec__',
 '__version__',
 '_built_with_meson',
 '_config',
 '_is_numpy_dev',
 '_libs',
 '_pandas_datetime_CAPI',
 '_pandas_parser_CAPI',
 '_testing',
 '_typing',
 '_version_meson',
 'annotations',
 'api',
 'array',
 'arrays',
 'bdate_range',
 'compat',
 'concat',
 'core',
 'crosstab',
 'cut',
 'date_range',
 'describe_option',
 'errors',
 'eval',
 'factorize',
 'from_dummies',
 'get_dummies',
 'get_option',
 'infer_freq',
 'interval_range',
 'io',
 'isna',
 'isnull',
 'json_normalize',
 'lreshape',
 'melt',
 'merge',
 'merge_asof',
 'merge_ordered',
 'notna',
 'notnull',
 'offsets',
 'option_context',
 'options',
 'pandas',
 'period_range',
 'pivot',
 'pivot_table',
 'plotting',
 'qcut',
 'read_clipboard',
 'read_csv',
 'read_excel',
 'read_feather',
 'read_fwf',
 'read_gbq',
 'read_hdf',
 'read_html',
 'read_json',
 'read_orc',
 'read_parquet',
 'read_pickle',
 'read_sas',
 'read_spss',
 'read_sql',
 'read_sql_query',
 'read_sql_table',
 'read_stata',
 'read_table',
 'read_xml',
 'reset_option',
 'set_eng_float_format',
 'set_option',
 'show_versions',
 'test',
 'testing',
 'timedelta_range',
 'to_datetime',
 'to_numeric',
 'to_pickle',
 'to_timedelta',
 'tseries',
 'unique',
 'util',
 'value_counts',
 'wide_to_long']

In [26]:
df.head()

      Column1  Column2  Column3  Column4  Column5
Row1        0        1        2        3        4
Row2        5        6        7        8        9
Row3       10       11       12       13       14
Row4       15       16       17       18       19

In [30]:
df.iloc[0:2,2:4]

      Column3  Column4
Row1        2        3
Row2        7        8

In [31]:
df.describe()

         Column1    Column2    Column3    Column4    Column5
count   4.000000   4.000000   4.000000   4.000000   4.000000
mean    7.500000   8.500000   9.500000  10.500000  11.500000
std     6.454972   6.454972   6.454972   6.454972   6.454972
min     0.000000   1.000000   2.000000   3.000000   4.000000
25%     3.750000   4.750000   5.750000   6.750000   7.750000
50%     7.500000   8.500000   9.500000  10.500000  11.500000
75%    11.250000  12.250000  13.250000  14.250000  15.250000
max    15.000000  16.000000  17.000000  18.000000  19.000000

In [34]:
#converting dataframe into array
df.iloc[:,:].values

array([[ 0,  1,  2,  3,  4],
       [ 5,  6,  7,  8,  9],
       [10, 11, 12, 13, 14],
       [15, 16, 17, 18, 19]])

In [36]:
df['Column4'].value_counts()

Column4
3     1
8     1
13    1
18    1
Name: count, dtype: int64

In [40]:
df.isnull().sum()

Column1    0
Column2    0
Column3    0
Column4    0
Column5    0
dtype: int64

In [45]:
df['Column3'].unique()

array([ 2,  7, 12, 17])

In [77]:
df[(df['Column1']>2) & (df['Column1']<15)]

      Column1  Column2  Column3  Column4  Column5
Row2        5        6        7        8        9
Row3       10       11       12       13       14

# StringIO - In memory file format Object

In [81]:
import pandas as pd
from io import StringIO as sio

In [84]:
data = ('col1,col2,col3\n'
        '1,2,3\n'
        'h,j,4\n'
        't,r,e\n'
        '2,5,6')

In [85]:
type(data)

str

In [87]:
x=StringIO(data)

In [88]:
pd.read_csv(x)

  col1 col2 col3
0    1    2    3
1    h    j    4
2    t    r    e
3    2    5    6

In [96]:
df =pd.read_csv(StringIO(data),usecols=['col1','col2'])

In [104]:
df.to_csv('test.csv',index=False)

In [105]:
data = ('a,b,c,d\n'
            '1,2,3,4\n'
            '5,6,7,8\n'
            '9,10,11')

In [107]:
StringIO(data)

In [110]:
df=pd.read_csv(StringIO(data)

AttributeError: '_io.StringIO' object has no attribute 'datatype'

In [119]:
df

   a   b   c    d
0  1   2   3    4
1  5   6   7    8
2  9  10  11  NaN

In [111]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       3 non-null      int64
 1   b       3 non-null      int64
 2   c       3 non-null      int64
 3   d       2 non-null      float64
dtypes: float64(1), int64(3)
memory usage: 228.0 bytes

In [114]:
df=pd.read_csv(StringIO(data),dtype='object')

In [115]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       3 non-null      object
 1   b       3 non-null      object
 2   c       3 non-null      object
 3   d       2 non-null      object
dtypes: object(4)
memory usage: 228.0+ bytes

In [116]:
df

   a   b   c    d
0  1   2   3    4
1  5   6   7    8
2  9  10  11  NaN

In [121]:
df.isnull().sum()

a    0
b    0
c    0
d    1
dtype: int64

In [122]:
df['b'][1]

'6'

In [126]:
df=pd.read_csv(StringIO(data),dtype={'a':int,'b':float,'c':int})

In [127]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       3 non-null      int32
 1   b       3 non-null      float64
 2   c       3 non-null      int32
 3   d       2 non-null      float64
dtypes: float64(2), int32(2)
memory usage: 204.0 bytes

In [128]:
df

   a     b   c    d
0  1   2.0   3  4.0
1  5   6.0   7  8.0
2  9  10.0  11  NaN

In [131]:
df.dtypes

a      int32
b    float64
c      int32
d    float64
dtype: object

In [137]:
data = ('index,a,b,c\n'
           '4,apple,bat,5.7\n'
            '8,orange,cow,10')
pd.read_csv(StringIO(data),index_col=(0))

            a    b     c
index
4       apple  bat   5.7
8      orange  cow  10.0

In [143]:
# use index cols and usecols
data = ('a,b,c\n'
           '4,apple,bat\n'
            '8,orange,cow')
pd.read_csv(StringIO(data),usecols =('a','b','c'),index_col=(0))

        b    c
a
4   apple  bat
8  orange  cow

In [165]:
df=pd.read_csv('8d3b6596-b09e-4077-aebf-425193185a5b.csv')
df2=df.head().to_csv('data.csv')

In [155]:
df=pd.read_csv('8d3b6596-b09e-4077-aebf-425193185a5b.csv')
df

,Month,Year,OIL COMPANIES,Quantity (000 Metric Tonnes)
0,April,2023,"IOCL-BARAUNI,BIHAR",546.51
1,April,2023,IOCL TOTAL,6037.64
2,April,2023,ONGC TOTAL,1475.55
3,April,2023,RIL TOTAL,5355.74
4,May,2023,"IOCL-MATHURA, UTTAR PRADESH",833.52
...,...,...,...,...
1387,August,2022,"IOCL-PARADIP,ODISHA",2.10
1388,August,2022,CPCL-TOTAL,940.43
1389,August,2022,RIL TOTAL,5176.59
1390,September,2022,"IOCL-KOYALI, GUJARAT",1270.87
1391,September,2022,"IOCL-PANIPAT, HARYANA",1153.66

In [172]:
df.head().to_csv('data.csv')
df.head().to_csv('data.csv',index=False)